{
  "repos": [
    {
      "repo": "StatiCat",
      "title": "StatiCat (Creator)",
      "blurb": [
        "A custom Discord bot developed in Nextcord, a Python wrapper of the Discord API.<br>",
        "Created a custom wrapper for Interaction webhooks, unique from regular commands, including:",
        "<ul>",
        "<li>Decorators with at-runtime registration and reloading of Application Commands.</li>",
        "<li>Automatic selection of subclasses for command parsing and handling via overloaded object creation.</li>",
        "</ul>"
      ]
    },
    {
      "repo": "DuckyLighting",
      "title": "DuckyLighting (Creator)",
      "blurb": [
        "A standalone Python project that controls the by-key lighting of a Ducky One2 RGB keyboard.",
        "<ul>",
        "<li>Reverse-engineered Ducky’s USB protocol for lighting up the board by individual keys.</li>",
        "<li>Utilized a distribution of HIDAPI with a modified version of python-easyhid (C wrapper).</li>",
        "<li>Designed a metaclass to organize effect layers in a lighting configuration.</li>",
        "</ul>"
      ]
    },
    {
      "repo": "NotMalware-Game",
      "title": "Not Malware (Project Lead, Developer)",
      "blurb": [
        "Guided a team of four students over the course of six two-week sprints to create an original game in Java for CS 2340: Objects and Design at Georgia Tech.<br>",
        "Recognized by the professor and other students as one of the best three games out of 114 other games submitted by student teams in Spring 2021.",
        "<ul>",
        "<li>Created a custom collision system, an advanced level-generation algorithm, and a game runtime framework.</li>",
        "<li>Implemented a Gradle and Java 9 modules project structure for efficient development, building, and execution across different machines and operating systems.</li>",
        "</ul>"
      ],
      "altLink": {
        "title": "Itch.io Page",
        "link": "https://rnewton.itch.io/not-malware"
      }
    }
  ]
}